app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
<h4><i>Comments</i></h4>
<% @post.comments.each do |comment| %>