app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "pomidorko"], ["body", "Congratulations!"], ["post_id", 4], ["created_at", "2020-06-03 11:07:09.800397"], ["updated_at", "2020-06-03 11:07:09.800397"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comments_params)